{
  "backend/main.mo": "Main Motoko actor for the Gratitude Journal backend, implementing user profile management, theme preferences, and journal entry CRUD with image support, protected by role-based access control.",
  "feature_evidence.json": "Feature evidence report documenting two UI changes to EntryCard.tsx: making journal entry text full-width and repositioning edit/delete buttons to a dedicated bottom toolbar row.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to short descriptions summarizing the purpose and recent changes of each component, hook, and config file.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for the light and dark color themes used throughout the app.",
  "frontend/index.html": "Minimal HTML shell for the React SPA, mounting the app at the #root div and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component that orchestrates authentication state, profile setup flow, theme initialization, and renders the main journal UI with EntryForm and EntriesList.",
  "frontend/src/components/EntriesList.tsx": "Fetches and renders all user journal entries sorted by most recent first, with loading skeletons and an empty-state prompt.",
  "frontend/src/components/EntryCard.tsx": "Card component for a single journal entry displaying full-width text, a bottom toolbar with Add Photo, Edit/Delete (or Save/Cancel) buttons, inline editing with speech-to-text, image thumbnails with a full-screen viewer, and delete confirmation dialogs.",
  "frontend/src/components/EntryForm.tsx": "A form component for creating gratitude journal entries with text input, optional image attachments, and speech-to-text support, requiring authentication before submission.",
  "frontend/src/components/ImageUpload.tsx": "An image upload component that allows selecting multiple image files, displays previews with upload progress indicators, and supports removal of individual images.",
  "frontend/src/components/Layout.tsx": "The main app layout wrapper providing a sticky header with branding, login button, theme toggle, and a footer with attribution.",
  "frontend/src/components/LoginButton.tsx": "A button component that handles Internet Identity login and logout, showing appropriate loading and authenticated states.",
  "frontend/src/components/PhotoViewer.tsx": "A fullscreen lightbox component for viewing journal entry images with keyboard navigation support and previous/next controls.",
  "frontend/src/components/ProfileSetup.tsx": "A one-time profile setup form that collects the user's name and saves it with a default system theme preference.",
  "frontend/src/components/ThemeToggle.tsx": "A button that cycles through light, dark, and system theme modes, displaying the corresponding icon with a tooltip label.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an authenticated or anonymous backend actor, invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status to child components.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including user profile CRUD, theme preference, and journal entry operations (create, read, update, delete, image management).",
  "frontend/src/hooks/useSpeechRecognition.ts": "Custom hook wrapping the Web Speech API to provide start/stop listening controls, live transcript state, and a supported-feature flag.",
  "frontend/src/hooks/useTheme.ts": "Custom hook managing light/dark/system theme state, syncing with the authenticated user's backend preference and applying the resolved theme class to the document root.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines OKLCH-based CSS custom properties for a warm color palette in both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters (including hash-based routing), persisting them to sessionStorage, and cleaning sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with OKLCH color tokens, custom border radii, font family, animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Project state metadata describing the current task: making journal entry text full-width and repositioning edit/delete buttons in EntryCard.tsx, with two pending feature requirements."
}