{
  "backend/main.mo": "Main backend actor implementing journal entry CRUD operations, user profile management with theme preferences, and image attachment functionality, using authorization and blob-storage mixins for access control and file handling.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: full-screen photo viewer modal, navigation arrows for multi-photo viewing, and a fix for the voice-to-text transcription persistence bug.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing components, hooks, and configuration for the gratitude journal application with authentication, theming, voice-to-text, and photo viewing capabilities.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark themes, defining warm color palette tokens for backgrounds, foregrounds, borders, and UI elements.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag and module script loading for the gratitude journal app.",
  "frontend/src/App.tsx": "Root application component managing authentication state, theme initialization, profile setup flow, and conditional rendering of login prompt, profile setup modal, or main journal interface with entry form and entries list.",
  "frontend/src/components/EntriesList.tsx": "Component that fetches and displays journal entries in reverse chronological order with loading skeletons and an empty state message encouraging users to start their gratitude practice.",
  "frontend/src/components/EntryCard.tsx": "Journal entry card component with inline editing, voice-to-text support during editing, clickable image thumbnails that open PhotoViewer, add photo functionality with upload progress, and delete confirmations for both entries and individual photos.",
  "frontend/src/components/EntryForm.tsx": "Form component for creating gratitude journal entries with text input, speech recognition, and image upload capabilities. Handles submission by creating entries and attaching images via mutations.",
  "frontend/src/components/ImageUpload.tsx": "Component for uploading and managing multiple images using ExternalBlob, with file selection, preview grid, upload progress tracking, and removal functionality.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper providing header with branding and auth controls, main content area, and footer with caffeine.ai attribution.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that toggles between sign-in and sign-out states using Internet Identity, with loading states and error handling.",
  "frontend/src/components/PhotoViewer.tsx": "Full-screen modal photo viewer with navigation controls, keyboard shortcuts (arrows, escape), and image counter for viewing entry images.",
  "frontend/src/components/ProfileSetup.tsx": "Initial profile setup form that prompts new users to enter their name and saves it with a default theme preference.",
  "frontend/src/components/ThemeToggle.tsx": "Button component for cycling through light, dark, and system theme modes with appropriate icons and tooltips.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on authentication state, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing AuthClient lifecycle, identity state, login/logout flows, and delegation validity checking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profile operations (get, save, set theme) and journal entry CRUD operations (create, read, update, delete, add/remove images), all using the actor from useActor hook.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Custom React hook that wraps the Web Speech API to provide continuous speech-to-text transcription with interim and final results, returning transcript text, listening state, and start/stop controls.",
  "frontend/src/hooks/useTheme.ts": "Custom hook managing theme state (system/light/dark) that syncs with user profile preferences via backend, applies theme classes to document root, and listens to system theme changes.",
  "frontend/src/index.css": "Tailwind CSS configuration defining CSS custom properties for a warm, calming color palette with light and dark mode variants using OKLCH color space, including terracotta primary, sage secondary, and peach accent colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and methods to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the default theme with custom OKLCH color system, container settings, border radius variables, custom shadows, Inter font family, and animation keyframes for accordions and other UI elements.",
  "project_state.json": "Project state file tracking a gratitude journal app with Internet Identity authentication, voice-to-text transcription, image uploads, and dark mode support. Contains architectural notes, existing features, and a fix request for photo editing functionality that should support both creating new entries and editing existing ones."
}