{
  "backend/main.mo": "Main backend actor implementing journal entry CRUD operations, user profile management, theme preferences, and authorization using mixins for access control and blob storage.",
  "feature_evidence.json": "Feature evidence report documenting the removal of horizontal padding from journal entry text in EntryCard.tsx to achieve full-width text alignment.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing components for authentication, profile setup, journal entries, theme management, and image uploads.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system variables for light and dark themes with warm, calming color palette.",
  "frontend/index.html": "HTML entry point for the Gratitude Journal application with root div and module script reference.",
  "frontend/src/App.tsx": "Root application component orchestrating authentication flow, profile setup modal, theme initialization, and conditional rendering of login prompt or main journal interface.",
  "frontend/src/components/EntriesList.tsx": "Component fetching and displaying user journal entries in reverse chronological order with loading skeletons and empty state messaging.",
  "frontend/src/components/EntryCard.tsx": "Individual entry card displaying timestamp, full-width text content (without horizontal padding), images with delete confirmation, inline editing, and add photo functionality.",
  "frontend/src/components/EntryForm.tsx": "Journal entry creation form with textarea, voice-to-text microphone button, image upload component, and submission handling with loading states.",
  "frontend/src/components/ImageUpload.tsx": "React component for uploading multiple images with preview, progress tracking, and removal functionality using ExternalBlob for file handling.",
  "frontend/src/components/Layout.tsx": "Main layout component providing header with branding and auth controls, main content area, and footer with caffeine.ai attribution.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that toggles between sign-in and sign-out states using Internet Identity, with loading states and query cache management.",
  "frontend/src/components/ProfileSetup.tsx": "Onboarding form component for new users to enter their name and create their initial user profile with system theme preference.",
  "frontend/src/components/ThemeToggle.tsx": "Theme switcher button component cycling between light, dark, and system themes with appropriate icons and tooltips.",
  "frontend/src/hooks/useActor.ts": "Custom hook managing backend actor creation with authentication, handling both anonymous and authenticated states, and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and delegation validity with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for all backend operations including user profile management, journal entry CRUD operations, and image attachment handling.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Custom hook wrapping Web Speech API for voice-to-text transcription with continuous listening, interim results, and browser compatibility detection.",
  "frontend/src/hooks/useTheme.ts": "Custom React hook that manages theme state (system/light/dark), syncs with user profile preferences from backend, applies theme classes to DOM, listens for system preference changes, and provides a toggle function that cycles through theme options.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm, calming color palette (terracotta, sage, peach) for both light and dark modes using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings or hash-based routing, persisting them in sessionStorage, and cleaning sensitive parameters from the URL without page reload.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom color tokens (using OKLCH), border radius variables, container settings, and animation keyframes for accordion and other UI components.",
  "project_state.json": "Project metadata describing a gratitude journal app with Internet Identity authentication, voice-to-text transcription, image uploads per entry, dark mode support with user preferences, and photo editing/deletion capabilities."
}